casualjim.gotemplate
charliermarsh.ruff
dexterhaslem.factor
dotjoshjohnson.xml
eamodio.gitlens
editorconfig.editorconfig
foxundermoon.shell-format
golang.go
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode.makefile-tools
ms-vscode-remote.remote-containers
openai.chatgpt
pkief.material-icon-theme
redhat.vscode-yaml
richie5um2.vscode-sort-json
tamasfe.even-better-toml
task.vscode-task
timonwong.shellcheck
vue.volar
yzhang.markdown-all-in-one
ziglang.vscode-zig
